iscle/Watch_nRF52840/src/displayapp/screens/Clock.cpp
#include "Clock.h"

#include <date/date.h>

#include <cstdio>
#include "BatteryIcon.h"
#include "BleIcon.h"
#include "Symbols.h"
#include "components/battery/BatteryController.h"
#include "components/ble/BleController.h"
#include "../DisplayApp.h"
#include "displayapp/icons/clock/helpButton.c"
#include "displayapp/icons/clock/Okbutton.c"
#include "displayapp/icons/clock/TestButton.c"
#include "displayapp/icons/clock/Checkin.c"
#include "displayapp/icons/clock/Impact.c"
#include "displayapp/icons/clock/close.c"
#include "displayapp/icons/clock/Fall.c"
#include "displayapp/icons/clock/sensor.c"
#include "displayapp/icons/clock/arrowleft.c"
#include "displayapp/icons/clock/arrowright.c"
#include "displayapp/icons/battery/battery_05.c"
#include "displayapp/icons/battery/battery_20.c"
#include "displayapp/icons/battery/battery_50.c"
#include "displayapp/icons/battery/battery_100.c"
#include "displayapp/icons/bluetooth/bluetooth.c"
#include "displayapp/icons/bluetooth/bluetoothdis.c"
#include "displayapp/icons/bluetooth/pairdis.c"
#include "displayapp/icons/battery/charing.c"
#include "displayapp/icons/clock/pointclock.c"
#include "displayapp/icons/clock/pointsensor.c"
#include "displayapp/icons/clock/pointtest.c"
#include "displayapp/icons/battery/lowbattery.c"
#include "displayapp/icons/oxi/oxi.c"
#include "displayapp/icons/clock/pointoxi.c"
#include "displayapp/icons/battery/charingicon.c"
#include "displayapp/icons/battery/discharingicon.c"
#include "displayapp/icons/clock/leftCircle.c"
#include "displayapp/icons/clock/topCircle.c"
#include "displayapp/icons/clock/rightCircle.c"
#include "nrf_delay.h"

extern "C" {
    #include <lvgl/lvgl.h>
}

using namespace Watch::Applications::Screens;

extern lv_font_t San_Francisco_22;
extern lv_font_t San_Francisco_30;
extern lv_style_t* LabelBigStyle;
extern lv_style_t* LabelSanStyle;
extern lv_style_t* LabelSmallStyle;
LV_IMG_DECLARE(helpButton);  
LV_IMG_DECLARE(Okbutton);
LV_IMG_DECLARE(TestButton);
LV_IMG_DECLARE(battery_05);
LV_IMG_DECLARE(Checkin);
LV_IMG_DECLARE(impact);
LV_IMG_DECLARE(close);
LV_IMG_DECLARE(Fall);
LV_IMG_DECLARE(sensor);
LV_IMG_DECLARE(arrowleft);
LV_IMG_DECLARE(arrowright);
LV_IMG_DECLARE(battery_20);
LV_IMG_DECLARE(battery_50);
LV_IMG_DECLARE(battery_100);
LV_IMG_DECLARE(bluetooth);
LV_IMG_DECLARE(bluetoothdis);
LV_IMG_DECLARE(pairdis);
LV_IMG_DECLARE(charging);
LV_IMG_DECLARE(pointclock);
LV_IMG_DECLARE(pointtest);
LV_IMG_DECLARE(pointsensor);
LV_IMG_DECLARE(pointoxi);
LV_IMG_DECLARE(lowbattery);
LV_IMG_DECLARE(oxi);
LV_IMG_DECLARE(chargingicon);
LV_IMG_DECLARE(dischargingicon);
LV_IMG_DECLARE(leftCircle);
LV_IMG_DECLARE(topCircle);
LV_IMG_DECLARE(rightCircle);

static lv_obj_t * lv_icon_create(lv_obj_t*par, const void* img_src){
    lv_obj_t* icon = lv_btn_create( par, NULL);
    lv_obj_t *img = lv_img_create(icon, NULL);
    lv_img_set_src(img, img_src);
    lv_cont_set_layout(icon, LV_LAYOUT_COL_M);
    lv_cont_set_fit2(icon, LV_FIT_TIGHT, LV_FIT_TIGHT);
    lv_obj_set_auto_realign(icon, true);

    static lv_style_t style_rel;  lv_style_copy(&style_rel, &lv_style_transp_tight);
    lv_btn_set_style(icon, LV_BTN_STYLE_REL, &style_rel);
    style_rel.body.padding.top    = 10;
    style_rel.body.padding.left   = 10;
    style_rel.body.padding.right  = 10;
      
    static lv_style_t style_pr;   lv_style_copy(&style_pr, &style_rel);
    lv_btn_set_style(icon, LV_BTN_STYLE_PR, &style_pr); 
  return icon;
}


static void event_handler(lv_obj_t * obj, lv_event_t event) {
    Clock* screen = static_cast<Clock *>(obj->user_data);
     screen->OnObjectEvent(obj, event);
}

Clock::Clock(DisplayApp* app,
        Controllers::DateTime& dateTimeController,
        Controllers::Battery& batteryController,
        Controllers::Ble& bleController,
        Watch::Drivers::Acnt101& tempSensor,
        Modes mode 
        ) : Screen(app), dateTimeController{dateTimeController},
                         batteryController{batteryController},
                         bleController{bleController},
                         tempSensor{tempSensor},mode{mode} {

          lv_obj_clean(lv_scr_act());
          app->SetTouchMode(DisplayApp::TouchModes::Polling);     
        if((mode == Modes::Clock) ||(mode == Modes::Test)|| (mode == Modes::Sensor) || (mode == Modes::Oxi)){
          labelleft =  lv_icon_create(lv_scr_act(), &arrowleft);  
          labelleft->user_data = this;
          lv_obj_set_event_cb( labelleft, event_handler);
          lv_obj_align( labelleft, lv_scr_act(),LV_ALIGN_IN_RIGHT_MID, 10, 0);

          labelright =  lv_icon_create(lv_scr_act(), &arrowright);  
          labelright->user_data = this;
          lv_obj_set_event_cb(labelright, event_handler);
          lv_obj_align(labelright, lv_scr_act(),LV_ALIGN_IN_LEFT_MID, -10, 0);        
        }


        batteryIcon = lv_img_create(lv_scr_act(), NULL);
        lv_img_set_src(batteryIcon, &battery_100);        

        batteryPlug = lv_img_create(lv_scr_act(), NULL);
        lv_img_set_src(batteryPlug, &chargingicon);        

        bleIcon =  lv_img_create(lv_scr_act(), NULL);
        lv_img_set_src(bleIcon, &bluetooth);        

        logo = lv_label_create(lv_scr_act(), NULL);
        lv_label_set_style(logo, LV_LABEL_STYLE_MAIN, LabelSanStyle);
        lv_label_set_text(logo, "OEM Name"); 
        lv_obj_align(logo, lv_scr_act(), LV_ALIGN_IN_TOP_LEFT, 0, 0); 

        lv_obj_align(batteryIcon, lv_scr_act(), LV_ALIGN_IN_TOP_RIGHT, -5, 5);
        lv_obj_align(bleIcon, batteryIcon, LV_ALIGN_OUT_LEFT_MID, -5, 0);
        lv_obj_align(batteryPlug, bleIcon, LV_ALIGN_OUT_LEFT_MID, -5, 0);

         static lv_style_t  labelStyle;
        lv_style_copy(& labelStyle, &lv_style_plain);
        labelStyle.text.font = &San_Francisco_30;
        labelStyle.text.color=LV_COLOR_WHITE;
        

        switch (mode){
        case Modes::Clock:
          batteryController.setGoToSleep(true);
          label_time = lv_label_create(lv_scr_act(), NULL);
          lv_label_set_text(label_time, "");                   
          lv_label_set_style(label_time, LV_LABEL_STYLE_MAIN,LabelSmallStyle);
          lv_obj_align(label_time, lv_scr_act(), LV_ALIGN_IN_TOP_LEFT, 0, 30);
          
          label_date = lv_label_create(lv_scr_act(), NULL);
          lv_label_set_text(label_date,"");
          lv_label_set_style(label_date, LV_LABEL_STYLE_MAIN, LabelSanStyle);
          lv_obj_align(label_date, lv_scr_act(), LV_ALIGN_IN_TOP_LEFT, 0, 65);

          buttonBig =  lv_icon_create(lv_scr_act(), &helpButton);      
          lv_obj_align(buttonBig, NULL, LV_ALIGN_CENTER, 0,30);

          
          lableleftCircle =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(lableleftCircle, &leftCircle);
          lv_obj_align(lableleftCircle, lv_scr_act(), LV_ALIGN_CENTER, -58, 34); 

          labletopCircle =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(labletopCircle, &topCircle);
          lv_obj_align(labletopCircle, lv_scr_act(), LV_ALIGN_CENTER, 0, -18); 

          lablerightCircle =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(lablerightCircle, &rightCircle);
          lv_obj_align(lablerightCircle, lv_scr_act(), LV_ALIGN_CENTER, 57, 34); 

