iscle/Watch_nRF52840/src/displayapp/screens/Clock.cpp
          lv_obj_set_hidden(lableleftCircle,true);
          lv_obj_set_hidden(labletopCircle,true);
          lv_obj_set_hidden(lablerightCircle,true);

          buttonSmall =  lv_icon_create(lv_scr_act(), &Okbutton);  
          lv_obj_align(buttonSmall, NULL, LV_ALIGN_IN_TOP_RIGHT, 0, 17); // PHAI LEN

          labelpoint  = lv_img_create(lv_scr_act(), NULL);  
          lv_img_set_src(labelpoint, &pointclock);
          lv_obj_align(labelpoint, NULL, LV_ALIGN_IN_BOTTOM_MID, 0, 0); 

          
          break;
        case Modes::Test:
          batteryController.setGoToSleep(true);
          buttonBig =  lv_icon_create(lv_scr_act(), &TestButton);  
          lv_obj_align(buttonBig, NULL, LV_ALIGN_CENTER, 0,30);
          
          lableleftCircle =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(lableleftCircle, &leftCircle);
          lv_obj_align(lableleftCircle, lv_scr_act(), LV_ALIGN_CENTER, -58, 34); 

          labletopCircle =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(labletopCircle, &topCircle);
          lv_obj_align(labletopCircle, lv_scr_act(), LV_ALIGN_CENTER, 0, -19); 

          lablerightCircle =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(lablerightCircle, &rightCircle);
          lv_obj_align(lablerightCircle, lv_scr_act(), LV_ALIGN_CENTER, 57, 34); 

          lv_obj_set_hidden(lableleftCircle,true);
          lv_obj_set_hidden(labletopCircle,true);
          lv_obj_set_hidden(lablerightCircle,true);


          labelpoint  = lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(labelpoint, &pointtest);
          lv_obj_align(labelpoint, NULL, LV_ALIGN_IN_BOTTOM_MID, 0, 0); 
          batteryController.setGoToSleep(true);
          timeoutCountStart = xTaskGetTickCount();
          break;  
        case Modes::CheckIn:
          buttonBig =  lv_icon_create(lv_scr_act(), &Checkin);  
          lv_obj_align(buttonBig, NULL, LV_ALIGN_CENTER, 0,30);

          lableleftCircle =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(lableleftCircle, &leftCircle);
          lv_obj_align(lableleftCircle, lv_scr_act(), LV_ALIGN_CENTER, -58, 34); 

          labletopCircle =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(labletopCircle, &topCircle);
          lv_obj_align(labletopCircle, lv_scr_act(), LV_ALIGN_CENTER, 0, -19); 

          lablerightCircle =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(lablerightCircle, &rightCircle);
          lv_obj_align(lablerightCircle, lv_scr_act(), LV_ALIGN_CENTER, 57, 34); 

          lv_obj_set_hidden(lableleftCircle,true);
          lv_obj_set_hidden(labletopCircle,true);
          lv_obj_set_hidden(lablerightCircle,true);

          buttonSmall =  lv_icon_create(lv_scr_act(), &close);  
          lv_obj_align(buttonSmall, NULL, LV_ALIGN_IN_TOP_RIGHT, 0, 17);

          break;
        case Modes::Impact:
          buttonBig =  lv_icon_create(lv_scr_act(), &impact);  
          timeoutCountStart = xTaskGetTickCount();
          batteryController.setisButtonPushed(false); 
          lv_obj_align(buttonBig, NULL, LV_ALIGN_CENTER, 0,30);

          lableleftCircle =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(lableleftCircle, &leftCircle);
          lv_obj_align(lableleftCircle, lv_scr_act(), LV_ALIGN_CENTER, -58, 34); 

          labletopCircle =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(labletopCircle, &topCircle);
          lv_obj_align(labletopCircle, lv_scr_act(), LV_ALIGN_CENTER, 0, -18); 

          lablerightCircle =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(lablerightCircle, &rightCircle);
          lv_obj_align(lablerightCircle, lv_scr_act(), LV_ALIGN_CENTER, 57, 34); 

          lv_obj_set_hidden(lableleftCircle,true);
          lv_obj_set_hidden(labletopCircle,true);
          lv_obj_set_hidden(lablerightCircle,true);

          buttonSmall =  lv_icon_create(lv_scr_act(), &Okbutton);  
          lv_obj_align(buttonSmall, NULL, LV_ALIGN_IN_TOP_RIGHT, 0, 17);


          break;
        case Modes::Fall:
          buttonBig =  lv_icon_create(lv_scr_act(), &Fall);  
          timeoutCountStart = xTaskGetTickCount();
          batteryController.setisButtonPushed(false); 
          lv_obj_align(buttonBig, NULL, LV_ALIGN_CENTER, 0,30);

          lableleftCircle =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(lableleftCircle, &leftCircle);
          lv_obj_align(lableleftCircle, lv_scr_act(), LV_ALIGN_CENTER, -58, 34); 

          labletopCircle =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(labletopCircle, &topCircle);
          lv_obj_align(labletopCircle, lv_scr_act(), LV_ALIGN_CENTER, 0, -19); 

          lablerightCircle =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(lablerightCircle, &rightCircle);
          lv_obj_align(lablerightCircle, lv_scr_act(), LV_ALIGN_CENTER, 57, 34); 

          lv_obj_set_hidden(lableleftCircle,true);
          lv_obj_set_hidden(labletopCircle,true);
          lv_obj_set_hidden(lablerightCircle,true);

          buttonSmall =  lv_icon_create(lv_scr_act(), &Okbutton);  
          lv_obj_align(buttonSmall, NULL, LV_ALIGN_IN_TOP_RIGHT, 0, 17);


          break;
        case Modes::Sensor:  
          imgSensor = lv_img_create(lv_scr_act(), NULL);  
          lv_img_set_src(imgSensor, &sensor);
          lv_obj_align(imgSensor, NULL, LV_ALIGN_CENTER, 0, 0);   

          heartbeatValue = lv_label_create(lv_scr_act(), nullptr);
          lv_obj_set_auto_realign(heartbeatValue, true);
          lv_label_set_text(heartbeatValue, "--");
          lv_label_set_style(heartbeatValue,LV_LABEL_STYLE_MAIN,&labelStyle);
          lv_obj_align(heartbeatValue, lv_scr_act(), LV_ALIGN_IN_BOTTOM_MID, 5, -55);

          tempCValue = lv_label_create(lv_scr_act(), nullptr);
          lv_obj_set_auto_realign(tempCValue, true);
          lv_label_set_text(tempCValue, "--");
          lv_label_set_style( tempCValue,LV_LABEL_STYLE_MAIN,&labelStyle);
          lv_obj_align( tempCValue,lv_scr_act(), LV_ALIGN_CENTER, 18, -60);

