iscle/Watch_nRF52840/src/displayapp/screens/Clock.cpp
          tempFValue = lv_label_create(lv_scr_act(), nullptr);
          lv_obj_set_auto_realign(tempFValue, true);
          lv_label_set_text(tempFValue, "--");
          lv_label_set_style( tempFValue,LV_LABEL_STYLE_MAIN,&labelStyle);
          lv_obj_align( tempFValue,lv_scr_act(), LV_ALIGN_CENTER, 18, -10);

          labelpoint  = lv_img_create(lv_scr_act(), NULL);  
          lv_img_set_src(labelpoint, &pointsensor);
          lv_obj_align(labelpoint, NULL, LV_ALIGN_IN_BOTTOM_MID, 0, 0); 
          heartRateSensor.HrInit();
          tempSensor.start(); 
          break;  
        case Modes::PairDis:  
          batteryController.setGoToSleep(true);  
          imgpair = lv_img_create(lv_scr_act(), nullptr);  
          lv_img_set_src(imgpair, &pairdis);
          lv_obj_align(imgpair, nullptr, LV_ALIGN_CENTER, 0, 10);  
          break;
        case Modes::Charging:
          batteryController.setGoToSleep(true);   
          imgpair = lv_img_create(lv_scr_act(), nullptr);  
          lv_img_set_src(imgpair, &charging);
          lv_obj_align(imgpair, nullptr, LV_ALIGN_CENTER, 0, 10); 
          timeoutCountStart = xTaskGetTickCount();

          tempCValue = lv_label_create(lv_scr_act(), nullptr);
          lv_label_set_text(tempCValue, "--");
          lv_label_set_style(tempCValue, LV_LABEL_STYLE_MAIN, LabelSanStyle);
          lv_obj_align( tempCValue,lv_scr_act(), LV_ALIGN_CENTER, -20, 40);
          break;
        case Modes::LowBattery:         
          batteryController.setGoToSleep(true);  
          imgpair = lv_img_create(lv_scr_act(), nullptr);  
          lv_img_set_src(imgpair, &lowbattery);
          lv_obj_align(imgpair, nullptr, LV_ALIGN_CENTER, 0, 10); 
          timeoutCountStart = xTaskGetTickCount();

          tempCValue = lv_label_create(lv_scr_act(), nullptr);
          lv_label_set_text(tempCValue, "--");
          lv_label_set_style(tempCValue, LV_LABEL_STYLE_MAIN, LabelSanStyle);
          lv_obj_align( tempCValue,lv_scr_act(), LV_ALIGN_CENTER, -20, 40);
          break;

        case Modes::Oxi:
          heartRateSensor.SpO2Init();  
          spO2=98+rand() % (1 - 0 + 1) + 0;
          imgpair = lv_img_create(lv_scr_act(), nullptr);  
          lv_img_set_src(imgpair, &oxi);
          lv_obj_align(imgpair, nullptr, LV_ALIGN_CENTER, 0, 10);

          heartbeatValue = lv_label_create(lv_scr_act(), nullptr);
          lv_label_set_text(heartbeatValue, "--");
          lv_label_set_style(heartbeatValue,LV_LABEL_STYLE_MAIN,&labelStyle);
          lv_obj_align(heartbeatValue, lv_scr_act(), LV_ALIGN_IN_BOTTOM_MID, -10, -65); 

          labelpoint  = lv_img_create(lv_scr_act(), NULL);  
          lv_img_set_src(labelpoint, &pointoxi);
          lv_obj_align(labelpoint, NULL, LV_ALIGN_IN_BOTTOM_MID, 0, 0); 

          break;
        default:
          break;
    }
 }

Clock::~Clock() {
  lv_obj_clean(lv_scr_act());
  app->SetTouchMode(DisplayApp::TouchModes::Gestures);
  batteryController.setcheckVibrate(false);
  batteryController.setisButtonPushed(false);
  heartRateSensor.Disable(); 
  tempSensor.stop();
}

bool Clock::Refresh() {
    auto month =dateTimeController.Month();
    auto day = dateTimeController.Day();
    auto dayOfWeek = dateTimeController.DayOfWeek();
    auto hour =  dateTimeController.Hours();  
    auto minute =  dateTimeController.Minutes();  
    char timeStr[5];
    sprintf(timeStr, "%02d:%02d", static_cast<int>(hour), static_cast<int>(minute));     
        
    auto batteryPercent = batteryController.PercentRemaining();
    if(batteryPercent<25) lv_img_set_src(batteryIcon, &battery_05);
    else if(batteryPercent<50) lv_img_set_src(batteryIcon, &battery_20);
    else if(batteryPercent<75) lv_img_set_src(batteryIcon, &battery_50);
    else lv_img_set_src(batteryIcon, &battery_100);
    char strBat[4];
    sprintf (strBat, "%d", uint8_t(batteryPercent));
    auto isCharging = batteryController.IsCharging()||batteryController.IsPowerPresent();
    if(isCharging){
       lv_img_set_src(batteryPlug, &chargingicon);
      if(batteryPercent>98) lv_obj_set_hidden(batteryPlug,false);
    } else lv_obj_set_hidden(batteryPlug,true);

    if (bleController.IsConnected()) { lv_img_set_src(bleIcon, &bluetooth);} 
    else { lv_img_set_src(bleIcon, &bluetoothdis); }  
  
    lv_obj_align(batteryIcon, lv_scr_act(), LV_ALIGN_IN_TOP_RIGHT, -5, 5);
    lv_obj_align(bleIcon, batteryIcon, LV_ALIGN_OUT_LEFT_MID, -5, 0);
    lv_obj_align(batteryPlug, bleIcon, LV_ALIGN_OUT_LEFT_MID, -5, 0);

  switch (mode)  {
  case Modes::Clock: 
    char dateStr[15];
    sprintf(dateStr, "%s, %s %d", DayOfWeekToString(dayOfWeek),MonthToString(month),day);
    lv_label_set_text(label_date, dateStr); 
    lv_label_set_text(label_time, timeStr); 
  if((xTaskGetTickCount()-timeoutCountStart) < 1.5*1024) {checkTouchBigButton = false;}
    if(checkTouchBigButton) {
          lv_obj_set_hidden(lableleftCircle,false);
          lv_obj_set_hidden(labletopCircle,false);
          lv_obj_set_hidden(lablerightCircle,false);

    } else {
          lv_obj_set_hidden(lableleftCircle,true);
          lv_obj_set_hidden(labletopCircle,true);
          lv_obj_set_hidden(lablerightCircle,true);
    }
    checkTouchBigButton = false;
    break;
  case Modes::Test:
      timeout=xTaskGetTickCount()-timeoutCountStart; 
      if((timeout>1*1024) & !checkTest) { 
      if(batteryController.PercentRemaining()<25) batteryController.setButtonDataNoVibrate(0x05); 
      else batteryController.setButtonDataNoVibrate(0x06);  
      checkTest=true;                 
    }
    if((xTaskGetTickCount()-timeoutCountStartL) < 1.5*1024) {checkTouchBigButton = false;}
    if(checkTouchBigButton) {
          lv_obj_set_hidden(lableleftCircle,false);
          lv_obj_set_hidden(labletopCircle,false);
          lv_obj_set_hidden(lablerightCircle,false);

    } else {
          lv_obj_set_hidden(lableleftCircle,true);
          lv_obj_set_hidden(labletopCircle,true);
          lv_obj_set_hidden(lablerightCircle,true);
    }
    checkTouchBigButton = false;

    break; 
    case Modes::CheckIn:         
    if(batteryController.isTimerStart1() && (batteryController.getCheckinTime1()== batteryController.getCurrentHour()) && ( batteryController.getCurrentMinute() <3)) {   
          batteryController.setcheckVibrate(true); 
        if(batteryController.isTimerDone1()||batteryController.getisButtonPushed()) {
            batteryController.setButtonData(0x14);          
            batteryController.setGoToSleep(true);
            batteryController.setcheckVibrate(false);          
          }
        if(batteryController.getcheckVibrate()) batteryController.setIsVibrate();  
    } else if( batteryController.isTimerStart1() && (batteryController.getCheckinTime1()== batteryController.getCurrentHour()) && ( batteryController.getCurrentMinute() ==3)) {  
            batteryController.setButtonData(0x16); 
            batteryController.setIsAlert(0x16);       
            batteryController.setGoToSleep(true);         
    } 
  
    if(batteryController.isTimerStart2() && (batteryController.getCheckinTime2()== batteryController.getCurrentHour()) && ( batteryController.getCurrentMinute() <3)) {   
         batteryController.setcheckVibrate(true); 
        if(batteryController.isTimerDone2()||batteryController.getisButtonPushed()) {
            batteryController.setButtonData(0x15);          
            batteryController.setGoToSleep(true); 
            batteryController.setcheckVibrate(false);       
          }
         if(batteryController.getcheckVibrate()) batteryController.setIsVibrate();  
    } else if( batteryController.isTimerStart2() && (batteryController.getCheckinTime2()== batteryController.getCurrentHour()) && ( batteryController.getCurrentMinute() ==3)) {  
            batteryController.setButtonData(0x17); 
            batteryController.setIsAlert(0x17);       
            batteryController.setGoToSleep(true);            
    } 

    if((xTaskGetTickCount()-timeoutCountStartL) < 1.5*1024) {checkTouchBigButton = false;}
    if(checkTouchBigButton) {
          lv_obj_set_hidden(lableleftCircle,false);
          lv_obj_set_hidden(labletopCircle,false);
          lv_obj_set_hidden(lablerightCircle,false);

    } else {
          lv_obj_set_hidden(lableleftCircle,true);
          lv_obj_set_hidden(labletopCircle,true);
          lv_obj_set_hidden(lablerightCircle,true);
    }
    checkTouchBigButton = false;

    break; 
    case Modes::Impact:
    timeout=xTaskGetTickCount()-timeoutCountStart;
    if(timeout<30*1024) { 
      if((batteryController.getimpactyy()==0x04) || batteryController.getisButtonPushed()) {
        batteryController.setcheckVibrate(false); 
      } else batteryController.setcheckVibrate(true);
      if(batteryController.getcheckVibrate()) batteryController.setIsVibrate(); 
    } else if((timeout<31*1024) && !batteryController.getisButtonPushed()) batteryController.setButtonData(0x13); 

      if((xTaskGetTickCount()-timeoutCountStartL) < 1.5*1024) {checkTouchBigButton = false;}
    if(checkTouchBigButton) {
          lv_obj_set_hidden(lableleftCircle,false);
          lv_obj_set_hidden(labletopCircle,false);
          lv_obj_set_hidden(lablerightCircle,false);

    } else {
          lv_obj_set_hidden(lableleftCircle,true);
          lv_obj_set_hidden(labletopCircle,true);
          lv_obj_set_hidden(lablerightCircle,true);
    }
    checkTouchBigButton = false;


    break; 
    case Modes::Fall:
      timeout=xTaskGetTickCount()-timeoutCountStart; 
      if(timeout<30*1024) { 
        if (batteryController.getfallyy()==0x06|| batteryController.getisButtonPushed())  {
          batteryController.setcheckVibrate(false);
        } else batteryController.setcheckVibrate(true); 
      if(batteryController.getcheckVibrate()) batteryController.setIsVibrate();     
      } else if((timeout<31*1024) && !batteryController.getisButtonPushed()) batteryController.setButtonData(0x04);

    if((xTaskGetTickCount()-timeoutCountStartL) < 1.5*1024) {checkTouchBigButton = false;}
    if(checkTouchBigButton) {
          lv_obj_set_hidden(lableleftCircle,false);
          lv_obj_set_hidden(labletopCircle,false);
          lv_obj_set_hidden(lablerightCircle,false);

    } else {
          lv_obj_set_hidden(lableleftCircle,true);
          lv_obj_set_hidden(labletopCircle,true);
          lv_obj_set_hidden(lablerightCircle,true);
    }
    checkTouchBigButton = false;
 
    break; 
    case Modes::Sensor:
        heartrate=heartRateSensor.ReadHr();
        mod++;
        flag++;
        char hr[4];
        if((heartrate<2) || (heartrate>180)) {
        if(std::fmod(mod/5,5)) lv_label_set_text(heartbeatValue, "--");
        else lv_label_set_text(heartbeatValue, "");     
        }
        else {sprintf(hr, "%d", heartrate); lv_label_set_text(heartbeatValue, hr);  }       
      if(!checktemp1){
            if(std::fmod(mod/5,5)) {
              lv_label_set_text(tempCValue, "--");
              lv_label_set_text(tempFValue, "--");
            }
            else {lv_label_set_text(tempCValue, "");
              lv_label_set_text(tempFValue, "");
            }          
        } else {       
      if((flag>60) && tempSensor.getIsCount()){
          flag=0;
          float rawTemp= tempSensor.Update();
          if((rawTemp>20.0f) && (rawTemp<80.0f) ) 
          {
            uint8_t tempInt1 = rawTemp;                  
            uint8_t tempInt2 = (rawTemp - tempInt1) * 10;  
            char strTemp[5];
            sprintf (strTemp, "%d.%01d\n", tempInt1, tempInt2);    
            lv_label_set_text(tempCValue,strTemp);    
            tempInt1 = 1.8f*rawTemp + 32;
            tempInt2 = (1.8f*rawTemp + 32 - tempInt1) * 10;
            sprintf (strTemp, "%d.%01d\n", tempInt1, tempInt2); 
            lv_label_set_text(tempFValue,strTemp);
          }
        }  
      } 
      break;

