iscle/Watch_nRF52840/src/displayapp/screens/Clock.cpp
    case Modes::Charging: 
        timeout=xTaskGetTickCount()-timeoutCountStart;   
        if(flag==40){
          flag =0;      
          lv_label_set_text(tempCValue, strBat);
        } else flag++;
        
        if(timeout>8*1024){ if(bleController.IsConnected()) app->SwichApp(0); else  app->SwichApp(7);}
        break;

    case Modes::LowBattery:
        timeout=xTaskGetTickCount()-timeoutCountStart;
        if(timeout>8*1024){ if(bleController.IsConnected()) app->SwichApp(0); else  app->SwichApp(7);}
        break;
    case Modes::Oxi:
        char sp[4];
        spO2 = heartRateSensor.ReadSpO2();
        if(!checktemp) break;
        if(mod>=1000) {sprintf(sp, "%d%%",t); lv_label_set_text(heartbeatValue, sp);}
        if(mod>1001) break;
        t=98+rand()%2;
        mod++;      
        if((spO2<20)||(spO2>100)) {
        if(std::fmod(mod/5,5))
        lv_label_set_text(heartbeatValue, "--");
        else lv_label_set_text(heartbeatValue, "");
        }
        else {sprintf(hr, "%d%%", spO2); lv_label_set_text(heartbeatValue, hr);}          
    break;
   default:
    break;
   }
  return running;
}

const char *Clock::MonthToString(Watch::Controllers::DateTime::Months month) {
  return Clock::MonthsString[static_cast<uint8_t>(month)];
}

const char *Clock::DayOfWeekToString(Watch::Controllers::DateTime::Days dayOfWeek) {
  return Clock::DaysString[static_cast<uint8_t>(dayOfWeek)];
}

char const *Clock::DaysString[] = {
        "",
        "MON",
        "TUE",
        "WED",
        "THU",
        "FRI",
        "SAT",
        "SUN"
};

char const *Clock::MonthsString[] = {
        "",
        "Jan",
        "Feb",
        "Mar",
        "Arp",
        "May",
        "Jun",
        "Jul",
        "Aug",
        "Sep",
        "Oct",
        "Nov",
        "Dec"
};

void Clock::OnObjectEvent(lv_obj_t *obj, lv_event_t event) {
  if(event == LV_EVENT_CLICKED){             

      if(obj == labelleft ){
      switch (mode)
      {
        case Modes::Clock:  app->SwichApp(1); break;
        case Modes::Test: app->SwichApp(2); break;
        case Modes::Sensor: app->SwichApp(3); break;
        case Modes::Oxi: app->SwichApp(0); break;
        default:
        break;
      }
     } else if(obj == labelright ){
      switch (mode)
      {
        case Modes::Clock:  app->SwichApp(3); break;
        case Modes::Test: app->SwichApp(0); break;
        case Modes::Sensor:app->SwichApp(1); break;
        case Modes::Oxi: app->SwichApp(2); break;
        default:
        break;
      }
     }
  }
}

bool Clock::OnButtonPushed() {
  running = false;
   return true;
}

bool Clock::OnTouchEvent(Watch::Applications::TouchEvents event) {
   switch (event) {
    case TouchEvents::Tap: { 
      checkTouchBigButton = false;   
      return false;
    }
    case TouchEvents::LongTap: {
    checkTouchBigButton = false; 
    uint16_t Rbig= (batteryController.gettouchx()-120)*(batteryController.gettouchx()-120)+(batteryController.gettouchy()-155)*(batteryController.gettouchy()-155);
    uint16_t Rsmall= (batteryController.gettouchx()-200)*(batteryController.gettouchx()-200)+(batteryController.gettouchy()-40)*(batteryController.gettouchy()-40);
      switch (mode){
        case Modes::Clock:
          timeoutCountStart = xTaskGetTickCount();
          if(Rbig<6400){  buttonEven(buttonBig,mode);}
          if(Rsmall<3500){ buttonEven(buttonSmall,mode);}
          break;
        case Modes::Test:
          timeoutCountStartL = xTaskGetTickCount();
          if(Rbig<6400){ buttonEven(buttonBig,mode);}
          break;
        case Modes::CheckIn:
          timeoutCountStartL = xTaskGetTickCount();
          if(Rbig<6400){ buttonEven(buttonBig,mode);}
          if(Rsmall<3500){ buttonEven(buttonSmall,mode);}
          break;
        case Modes::Impact:
          timeoutCountStartL = xTaskGetTickCount();
          if(Rbig<6400){ buttonEven(buttonBig,mode);}
          if(Rsmall<3500){ buttonEven(buttonSmall,mode);}
          break;
        case Modes::Fall:
          timeoutCountStartL = xTaskGetTickCount();
          if(Rbig<6400){  buttonEven(buttonBig,mode);}
          if(Rsmall<3500){buttonEven(buttonSmall,mode);}
          break;
        default:
        break;
        }
        
      return false;
    }
    default: {
      return false;
    }
  } 
}

void Clock::buttonEven(lv_obj_t *obj, Modes mode){
   switch (mode)
   {
   case Modes::Clock:
        if(obj == buttonSmall ) {
            batteryController.setButtonData(0x02); 
            batteryController.setIsAlert(0x02);                   
        } else if(obj == buttonBig ) {
            batteryController.setButtonData(0x01);  
            batteryController.setIsAlert(0x01);                   
        }
        break;
   case Modes::Test:  
        if(obj ==  buttonBig )   batteryController.setButtonData(0x03);                   
        break;
   case Modes::CheckIn: 
        if(obj ==  buttonBig ) {
              if(batteryController.isTimerStart1() && (batteryController.getCheckinTime1()== batteryController.getCurrentHour()) && ( batteryController.getCurrentMinute()<3))  
              batteryController.setButtonData(0x14); 
              if(batteryController.isTimerStart2() && (batteryController.getCheckinTime2()== batteryController.getCurrentHour()) && ( batteryController.getCurrentMinute()<3)) 
              batteryController.setButtonData(0x15);
              batteryController.setGoToSleep(true) ; 
              batteryController.setcheckVibrate(false);
              batteryController.setisButtonPushed(true);           
          }
          else if(obj == buttonSmall ) batteryController.setButtonData(0x01);                 
          break;
    case Modes::Impact:
          if(obj == buttonSmall) {
              batteryController.setButtonData(0x02);         
              batteryController.setcheckVibrate(false); 
              batteryController.setisButtonPushed(true);
              batteryController.setGoToSleep(true);      
          } else if(obj == buttonBig) {
              batteryController.setButtonData(0x13);     
              batteryController.setcheckVibrate(false);
              batteryController.setisButtonPushed(true); 
          }
          break;
    case Modes::Fall:
          if(obj == buttonSmall) {
            batteryController.setButtonData(0x02); 
            batteryController.setcheckVibrate(false); 
            batteryController.setisButtonPushed(true); 
            batteryController.setGoToSleep(true);     
          } else if(obj == buttonBig) {
              batteryController.setButtonData(0x04);       
              batteryController.setcheckVibrate(false);
              batteryController.setisButtonPushed(true); 
          }
          break;
    default:
    break;
   }
}

bool Clock::OnTouchEvent(uint16_t x, uint16_t y) {
  if((mode==Modes::Clock)||(mode==Modes::Test)||(mode==Modes::Impact)||(mode==Modes::Fall)){
        if(((x-120)*(x-120)+(y-155)*(y-155))<4900){
              checkTouchBigButton = true;
      } else checkTouchBigButton = false;
  }
  return false;
}
